In [49]:
import pandas as pd
import numpy as np
data = {
    "EmpName": ["T. Ramesh", "M. Soumya", "R. Shyam", "S. Raghu"],
    "EmpId": ['20001', '20002', '20003', np.nan],
    "EmpDesig": ["Asst. Prof.", "Asst. Prof.", np.nan, "Asst. Prof."],
    "EmpSalary": [150000, 120000, 140000, np.nan]
}
df = pd.DataFrame(data)
df

     EmpName  EmpId     EmpDesig  EmpSalary
0  T. Ramesh  20001  Asst. Prof.   150000.0
1  M. Soumya  20002  Asst. Prof.   120000.0
2   R. Shyam  20003          NaN   140000.0
3   S. Raghu    NaN  Asst. Prof.        NaN

In [50]:
df["EmpSalary"].replace(np.nan,df["EmpSalary"].mean(),inplace=True)
df.replace(np.nan,"NA",inplace=True)
df

     EmpName  EmpId     EmpDesig      EmpSalary
0  T. Ramesh  20001  Asst. Prof.  150000.000000
1  M. Soumya  20002  Asst. Prof.  120000.000000
2   R. Shyam  20003           NA  140000.000000
3   S. Raghu     NA  Asst. Prof.  136666.666667

In [57]:
with open("Employee.txt","w") as f:
    f.write(str(df))